VCVRack/Rack/plugins/community/repos/Southpole/eurorack/stmlib/third_party/STM/STM32F37x_StdPeriph_Driver/src/stm32f37x_dma.c
  *** Interrupt Mode ***
  ======================
    [..] Each DMA channel can be managed through 4 Interrupts:
    (+) Interrupt Source
       (##) DMA_IT_TC: specifies the interrupt source for the Transfer Complete 
            event.
       (##) DMA_IT_HT : specifies the interrupt source for the Half-transfer Complete 
            event.
       (##) DMA_IT_TE : specifies the interrupt source for the transfer errors event.
       (##) DMA_IT_GL : to indicate that at least one of the interrupts described 
            above occurred.
    -@@- Clearing DMA_IT_GL interrupt results in clearing all other interrupts of 
        the same channel (DMA_IT_TCx, DMA_IT_HT and DMA_IT_TE).
    [..]In this Mode it is advised to use the following functions:
        (+) void DMA_ITConfig(DMA_Channel_TypeDef* DMAy_Channelx, uint32_t DMA_IT, 
            FunctionalState NewState);
        (+) ITStatus DMA_GetITStatus(uint32_t DMA_IT);
        (+) void DMA_ClearITPendingBit(uint32_t DMA_IT);

@endverbatim
  * @{
  */

/**
  * @brief  Enables or disables the specified DMAy Channelx interrupts.
  * @param  DMAy_Channelx: where y can be 1 or 2 to select the DMA and 
  *         x can be 1 to 7 for DMA1 and 1 to 5 for DMA2 to select the DMA Channel.
  * @param  DMA_IT: specifies the DMA interrupts sources to be enabled
  *         or disabled. 
  *          This parameter can be any combination of the following values:
  *            @arg DMA_IT_TC: Transfer complete interrupt mask
  *            @arg DMA_IT_HT: Half transfer interrupt mask
  *            @arg DMA_IT_TE: Transfer error interrupt mask
  * @param  NewState: new state of the specified DMA interrupts.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void DMA_ITConfig(DMA_Channel_TypeDef* DMAy_Channelx, uint32_t DMA_IT, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_DMA_ALL_PERIPH(DMAy_Channelx));
  assert_param(IS_DMA_CONFIG_IT(DMA_IT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the selected DMA interrupts */
    DMAy_Channelx->CCR |= DMA_IT;
  }
  else
  {
    /* Disable the selected DMA interrupts */
    DMAy_Channelx->CCR &= ~DMA_IT;
  }
}

/**
  * @brief  Checks whether the specified DMAy Channelx flag is set or not.
  * @param  DMAy_FLAG: specifies the flag to check.
  *          This parameter can be one of the following values:
  *            @arg DMA1_FLAG_GL1: DMA1 Channel1 global flag.
  *            @arg DMA1_FLAG_TC1: DMA1 Channel1 transfer complete flag.
  *            @arg DMA1_FLAG_HT1: DMA1 Channel1 half transfer flag.
  *            @arg DMA1_FLAG_TE1: DMA1 Channel1 transfer error flag.
  *            @arg DMA1_FLAG_GL2: DMA1 Channel2 global flag.
  *            @arg DMA1_FLAG_TC2: DMA1 Channel2 transfer complete flag.
  *            @arg DMA1_FLAG_HT2: DMA1 Channel2 half transfer flag.
  *            @arg DMA1_FLAG_TE2: DMA1 Channel2 transfer error flag.
  *            @arg DMA1_FLAG_GL3: DMA1 Channel3 global flag.
  *            @arg DMA1_FLAG_TC3: DMA1 Channel3 transfer complete flag.
  *            @arg DMA1_FLAG_HT3: DMA1 Channel3 half transfer flag.
  *            @arg DMA1_FLAG_TE3: DMA1 Channel3 transfer error flag.
  *            @arg DMA1_FLAG_GL4: DMA1 Channel4 global flag.
  *            @arg DMA1_FLAG_TC4: DMA1 Channel4 transfer complete flag.
  *            @arg DMA1_FLAG_HT4: DMA1 Channel4 half transfer flag.
  *            @arg DMA1_FLAG_TE4: DMA1 Channel4 transfer error flag.
  *            @arg DMA1_FLAG_GL5: DMA1 Channel5 global flag.
  *            @arg DMA1_FLAG_TC5: DMA1 Channel5 transfer complete flag.
  *            @arg DMA1_FLAG_HT5: DMA1 Channel5 half transfer flag.
  *            @arg DMA1_FLAG_TE5: DMA1 Channel5 transfer error flag.
  *            @arg DMA1_FLAG_GL6: DMA1 Channel6 global flag.
  *            @arg DMA1_FLAG_TC6: DMA1 Channel6 transfer complete flag.
  *            @arg DMA1_FLAG_HT6: DMA1 Channel6 half transfer flag.
  *            @arg DMA1_FLAG_TE6: DMA1 Channel6 transfer error flag.
  *            @arg DMA1_FLAG_GL7: DMA1 Channel7 global flag.
  *            @arg DMA1_FLAG_TC7: DMA1 Channel7 transfer complete flag.
  *            @arg DMA1_FLAG_HT7: DMA1 Channel7 half transfer flag.
  *            @arg DMA1_FLAG_TE7: DMA1 Channel7 transfer error flag.
  *            @arg DMA2_FLAG_GL1: DMA2 Channel1 global flag.
  *            @arg DMA2_FLAG_TC1: DMA2 Channel1 transfer complete flag.
  *            @arg DMA2_FLAG_HT1: DMA2 Channel1 half transfer flag.
  *            @arg DMA2_FLAG_TE1: DMA2 Channel1 transfer error flag.
  *            @arg DMA2_FLAG_GL2: DMA2 Channel2 global flag.
  *            @arg DMA2_FLAG_TC2: DMA2 Channel2 transfer complete flag.
  *            @arg DMA2_FLAG_HT2: DMA2 Channel2 half transfer flag.
  *            @arg DMA2_FLAG_TE2: DMA2 Channel2 transfer error flag.
  *            @arg DMA2_FLAG_GL3: DMA2 Channel3 global flag.
  *            @arg DMA2_FLAG_TC3: DMA2 Channel3 transfer complete flag.
  *            @arg DMA2_FLAG_HT3: DMA2 Channel3 half transfer flag.
  *            @arg DMA2_FLAG_TE3: DMA2 Channel3 transfer error flag.
  *            @arg DMA2_FLAG_GL4: DMA2 Channel4 global flag.
  *            @arg DMA2_FLAG_TC4: DMA2 Channel4 transfer complete flag.
  *            @arg DMA2_FLAG_HT4: DMA2 Channel4 half transfer flag.
  *            @arg DMA2_FLAG_TE4: DMA2 Channel4 transfer error flag.
  *            @arg DMA2_FLAG_GL5: DMA2 Channel5 global flag.
  *            @arg DMA2_FLAG_TC5: DMA2 Channel5 transfer complete flag.
  *            @arg DMA2_FLAG_HT5: DMA2 Channel5 half transfer flag.
  *            @arg DMA2_FLAG_TE5: DMA2 Channel5 transfer error flag.
  *     
  * @note   The Global flag (DMAy_FLAG_GLx) is set whenever any of the other flags 
  *         relative to the same channel is set (Transfer Complete, Half-transfer 
  *         Complete or Transfer Error flags: DMAy_FLAG_TCx, DMAy_FLAG_HTx or 
  *         DMAy_FLAG_TEx). 
  *      
  * @retval The new state of DMAy_FLAG (SET or RESET).
  */
FlagStatus DMA_GetFlagStatus(uint32_t DMAy_FLAG)
{
  FlagStatus bitstatus = RESET;
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_DMA_GET_FLAG(DMAy_FLAG));

  /* Calculate the used DMAy */
  if ((DMAy_FLAG & FLAG_Mask) != (uint32_t)RESET)
  {
    /* Get DMA2 ISR register value */
    tmpreg = DMA2->ISR ;
  }
  else
  {
    /* Get DMA1 ISR register value */
    tmpreg = DMA1->ISR ;
  }

  /* Check the status of the specified DMAy flag */
  if ((tmpreg & DMAy_FLAG) != (uint32_t)RESET)
  {
    /* DMAy_FLAG is set */
    bitstatus = SET;
  }
  else
  {
    /* DMAy_FLAG is reset */
    bitstatus = RESET;
  }
  
  /* Return the DMAy_FLAG status */
  return  bitstatus;
}

/**
  * @brief  Clears the DMAy Channelx's pending flags.
  * @param  DMAy_FLAG: specifies the flag to clear.
  *          This parameter can be any combination (for the same DMA) of the following values:
  *            @arg DMA1_FLAG_GL1: DMA1 Channel1 global flag.
  *            @arg DMA1_FLAG_TC1: DMA1 Channel1 transfer complete flag.
  *            @arg DMA1_FLAG_HT1: DMA1 Channel1 half transfer flag.
  *            @arg DMA1_FLAG_TE1: DMA1 Channel1 transfer error flag.
  *            @arg DMA1_FLAG_GL2: DMA1 Channel2 global flag.
  *            @arg DMA1_FLAG_TC2: DMA1 Channel2 transfer complete flag.
  *            @arg DMA1_FLAG_HT2: DMA1 Channel2 half transfer flag.
  *            @arg DMA1_FLAG_TE2: DMA1 Channel2 transfer error flag.
  *            @arg DMA1_FLAG_GL3: DMA1 Channel3 global flag.
  *            @arg DMA1_FLAG_TC3: DMA1 Channel3 transfer complete flag.
  *            @arg DMA1_FLAG_HT3: DMA1 Channel3 half transfer flag.
  *            @arg DMA1_FLAG_TE3: DMA1 Channel3 transfer error flag.
  *            @arg DMA1_FLAG_GL4: DMA1 Channel4 global flag.
  *            @arg DMA1_FLAG_TC4: DMA1 Channel4 transfer complete flag.
  *            @arg DMA1_FLAG_HT4: DMA1 Channel4 half transfer flag.
  *            @arg DMA1_FLAG_TE4: DMA1 Channel4 transfer error flag.
  *            @arg DMA1_FLAG_GL5: DMA1 Channel5 global flag.
  *            @arg DMA1_FLAG_TC5: DMA1 Channel5 transfer complete flag.
  *            @arg DMA1_FLAG_HT5: DMA1 Channel5 half transfer flag.
  *            @arg DMA1_FLAG_TE5: DMA1 Channel5 transfer error flag.
  *            @arg DMA1_FLAG_GL6: DMA1 Channel6 global flag.
  *            @arg DMA1_FLAG_TC6: DMA1 Channel6 transfer complete flag.
  *            @arg DMA1_FLAG_HT6: DMA1 Channel6 half transfer flag.
  *            @arg DMA1_FLAG_TE6: DMA1 Channel6 transfer error flag.
  *            @arg DMA1_FLAG_GL7: DMA1 Channel7 global flag.
  *            @arg DMA1_FLAG_TC7: DMA1 Channel7 transfer complete flag.
  *            @arg DMA1_FLAG_HT7: DMA1 Channel7 half transfer flag.
  *            @arg DMA1_FLAG_TE7: DMA1 Channel7 transfer error flag.
  *            @arg DMA2_FLAG_GL1: DMA2 Channel1 global flag.
  *            @arg DMA2_FLAG_TC1: DMA2 Channel1 transfer complete flag.
  *            @arg DMA2_FLAG_HT1: DMA2 Channel1 half transfer flag.
  *            @arg DMA2_FLAG_TE1: DMA2 Channel1 transfer error flag.
  *            @arg DMA2_FLAG_GL2: DMA2 Channel2 global flag.
  *            @arg DMA2_FLAG_TC2: DMA2 Channel2 transfer complete flag.
  *            @arg DMA2_FLAG_HT2: DMA2 Channel2 half transfer flag.
  *            @arg DMA2_FLAG_TE2: DMA2 Channel2 transfer error flag.
  *            @arg DMA2_FLAG_GL3: DMA2 Channel3 global flag.
  *            @arg DMA2_FLAG_TC3: DMA2 Channel3 transfer complete flag.
  *            @arg DMA2_FLAG_HT3: DMA2 Channel3 half transfer flag.
  *            @arg DMA2_FLAG_TE3: DMA2 Channel3 transfer error flag.
  *            @arg DMA2_FLAG_GL4: DMA2 Channel4 global flag.
  *            @arg DMA2_FLAG_TC4: DMA2 Channel4 transfer complete flag.
  *            @arg DMA2_FLAG_HT4: DMA2 Channel4 half transfer flag.
  *            @arg DMA2_FLAG_TE4: DMA2 Channel4 transfer error flag.
  *            @arg DMA2_FLAG_GL5: DMA2 Channel5 global flag.
  *            @arg DMA2_FLAG_TC5: DMA2 Channel5 transfer complete flag.
  *            @arg DMA2_FLAG_HT5: DMA2 Channel5 half transfer flag.
  *            @arg DMA2_FLAG_TE5: DMA2 Channel5 transfer error flag.
  *
  * @note   Clearing the Global flag (DMAy_FLAG_GLx) results in clearing all other flags
  *         relative to the same channel (Transfer Complete, Half-transfer Complete and
  *         Transfer Error flags: DMAy_FLAG_TCx, DMAy_FLAG_HTx and DMAy_FLAG_TEx).
  *
  * @retval None
  */
void DMA_ClearFlag(uint32_t DMAy_FLAG)
{
  /* Check the parameters */
  assert_param(IS_DMA_CLEAR_FLAG(DMAy_FLAG));

/* Calculate the used DMAy */
  if ((DMAy_FLAG & FLAG_Mask) != (uint32_t)RESET)
  {
    /* Clear the selected DMAy flags */
    DMA2->IFCR = DMAy_FLAG;
  }
  else
  {
    /* Clear the selected DMAy flags */
    DMA1->IFCR = DMAy_FLAG;
  }
}

/**
  * @brief  Checks whether the specified DMAy Channelx interrupt has occurred or not.
  * @param  DMAy_IT: specifies the DMAy interrupt source to check. 
  *          This parameter can be one of the following values:
  *            @arg DMA1_IT_GL1: DMA1 Channel1 global interrupt.
  *            @arg DMA1_IT_TC1: DMA1 Channel1 transfer complete interrupt.
  *            @arg DMA1_IT_HT1: DMA1 Channel1 half transfer interrupt.
  *            @arg DMA1_IT_TE1: DMA1 Channel1 transfer error interrupt.
  *            @arg DMA1_IT_GL2: DMA1 Channel2 global interrupt.
  *            @arg DMA1_IT_TC2: DMA1 Channel2 transfer complete interrupt.
  *            @arg DMA1_IT_HT2: DMA1 Channel2 half transfer interrupt.
  *            @arg DMA1_IT_TE2: DMA1 Channel2 transfer error interrupt.
  *            @arg DMA1_IT_GL3: DMA1 Channel3 global interrupt.
  *            @arg DMA1_IT_TC3: DMA1 Channel3 transfer complete interrupt.
  *            @arg DMA1_IT_HT3: DMA1 Channel3 half transfer interrupt.
  *            @arg DMA1_IT_TE3: DMA1 Channel3 transfer error interrupt.
  *            @arg DMA1_IT_GL4: DMA1 Channel4 global interrupt.
  *            @arg DMA1_IT_TC4: DMA1 Channel4 transfer complete interrupt.
  *            @arg DMA1_IT_HT4: DMA1 Channel4 half transfer interrupt.
  *            @arg DMA1_IT_TE4: DMA1 Channel4 transfer error interrupt.
  *            @arg DMA1_IT_GL5: DMA1 Channel5 global interrupt.
  *            @arg DMA1_IT_TC5: DMA1 Channel5 transfer complete interrupt.
  *            @arg DMA1_IT_HT5: DMA1 Channel5 half transfer interrupt.
  *            @arg DMA1_IT_TE5: DMA1 Channel5 transfer error interrupt.
  *            @arg DMA1_IT_GL6: DMA1 Channel6 global interrupt.
  *            @arg DMA1_IT_TC6: DMA1 Channel6 transfer complete interrupt.
  *            @arg DMA1_IT_HT6: DMA1 Channel6 half transfer interrupt.
  *            @arg DMA1_IT_TE6: DMA1 Channel6 transfer error interrupt.
  *            @arg DMA1_IT_GL7: DMA1 Channel7 global interrupt.
  *            @arg DMA1_IT_TC7: DMA1 Channel7 transfer complete interrupt.
  *            @arg DMA1_IT_HT7: DMA1 Channel7 half transfer interrupt.
  *            @arg DMA1_IT_TE7: DMA1 Channel7 transfer error interrupt.
  *            @arg DMA2_IT_GL1: DMA2 Channel1 global interrupt.
  *            @arg DMA2_IT_TC1: DMA2 Channel1 transfer complete interrupt.
  *            @arg DMA2_IT_HT1: DMA2 Channel1 half transfer interrupt.
  *            @arg DMA2_IT_TE1: DMA2 Channel1 transfer error interrupt.
  *            @arg DMA2_IT_GL2: DMA2 Channel2 global interrupt.
  *            @arg DMA2_IT_TC2: DMA2 Channel2 transfer complete interrupt.
  *            @arg DMA2_IT_HT2: DMA2 Channel2 half transfer interrupt.
  *            @arg DMA2_IT_TE2: DMA2 Channel2 transfer error interrupt.
  *            @arg DMA2_IT_GL3: DMA2 Channel3 global interrupt.
  *            @arg DMA2_IT_TC3: DMA2 Channel3 transfer complete interrupt.
  *            @arg DMA2_IT_HT3: DMA2 Channel3 half transfer interrupt.
  *            @arg DMA2_IT_TE3: DMA2 Channel3 transfer error interrupt.
  *            @arg DMA2_IT_GL4: DMA2 Channel4 global interrupt.
  *            @arg DMA2_IT_TC4: DMA2 Channel4 transfer complete interrupt.
  *            @arg DMA2_IT_HT4: DMA2 Channel4 half transfer interrupt.
  *            @arg DMA2_IT_TE4: DMA2 Channel4 transfer error interrupt.
  *            @arg DMA2_IT_GL5: DMA2 Channel5 global interrupt.
  *            @arg DMA2_IT_TC5: DMA2 Channel5 transfer complete interrupt.
  *            @arg DMA2_IT_HT5: DMA2 Channel5 half transfer interrupt.
  *            @arg DMA2_IT_TE5: DMA2 Channel5 transfer error interrupt.
  *     
  * @note   The Global interrupt (DMAy_FLAG_GLx) is set whenever any of the other 
  *         interrupts relative to the same channel is set (Transfer Complete, 
  *         Half-transfer Complete or Transfer Error interrupts: DMAy_IT_TCx, 
  *         DMAy_IT_HTx or DMAy_IT_TEx). 
  *      
  * @retval The new state of DMAy_IT (SET or RESET).
  */
ITStatus DMA_GetITStatus(uint32_t DMAy_IT)
{
  ITStatus bitstatus = RESET;
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_DMA_GET_IT(DMAy_IT));

  /* Calculate the used DMA */
  if ((DMAy_IT & FLAG_Mask) != (uint32_t)RESET)
  {
    /* Get DMA2 ISR register value */
    tmpreg = DMA2->ISR;
  }
  else
  {
    /* Get DMA1 ISR register value */
    tmpreg = DMA1->ISR;
  }

  /* Check the status of the specified DMAy interrupt */
  if ((tmpreg & DMAy_IT) != (uint32_t)RESET)
  {
    /* DMAy_IT is set */
    bitstatus = SET;
  }
  else
  {
    /* DMAy_IT is reset */
    bitstatus = RESET;
  }
  /* Return the DMAy_IT status */
  return  bitstatus;
}

/**
  * @brief  Clears the DMAy Channelx's interrupt pending bits.
  * @param  DMAy_IT: specifies the DMAy interrupt pending bit to clear.
  *          This parameter can be any combination (for the same DMA) of the following values:
  *            @arg DMA1_IT_GL1: DMA1 Channel1 global interrupt.
  *            @arg DMA1_IT_TC1: DMA1 Channel1 transfer complete interrupt.
  *            @arg DMA1_IT_HT1: DMA1 Channel1 half transfer interrupt.
  *            @arg DMA1_IT_TE1: DMA1 Channel1 transfer error interrupt.
  *            @arg DMA1_IT_GL2: DMA1 Channel2 global interrupt.
  *            @arg DMA1_IT_TC2: DMA1 Channel2 transfer complete interrupt.
  *            @arg DMA1_IT_HT2: DMA1 Channel2 half transfer interrupt.
  *            @arg DMA1_IT_TE2: DMA1 Channel2 transfer error interrupt.
  *            @arg DMA1_IT_GL3: DMA1 Channel3 global interrupt.
  *            @arg DMA1_IT_TC3: DMA1 Channel3 transfer complete interrupt.
  *            @arg DMA1_IT_HT3: DMA1 Channel3 half transfer interrupt.
  *            @arg DMA1_IT_TE3: DMA1 Channel3 transfer error interrupt.
  *            @arg DMA1_IT_GL4: DMA1 Channel4 global interrupt.
  *            @arg DMA1_IT_TC4: DMA1 Channel4 transfer complete interrupt.
  *            @arg DMA1_IT_HT4: DMA1 Channel4 half transfer interrupt.
  *            @arg DMA1_IT_TE4: DMA1 Channel4 transfer error interrupt.
  *            @arg DMA1_IT_GL5: DMA1 Channel5 global interrupt.
  *            @arg DMA1_IT_TC5: DMA1 Channel5 transfer complete interrupt.
  *            @arg DMA1_IT_HT5: DMA1 Channel5 half transfer interrupt.
  *            @arg DMA1_IT_TE5: DMA1 Channel5 transfer error interrupt.
  *            @arg DMA1_IT_GL6: DMA1 Channel6 global interrupt.
  *            @arg DMA1_IT_TC6: DMA1 Channel6 transfer complete interrupt.
  *            @arg DMA1_IT_HT6: DMA1 Channel6 half transfer interrupt.
  *            @arg DMA1_IT_TE6: DMA1 Channel6 transfer error interrupt.
  *            @arg DMA1_IT_GL7: DMA1 Channel7 global interrupt.
  *            @arg DMA1_IT_TC7: DMA1 Channel7 transfer complete interrupt.
  *            @arg DMA1_IT_HT7: DMA1 Channel7 half transfer interrupt.
  *            @arg DMA1_IT_TE7: DMA1 Channel7 transfer error interrupt.
  *            @arg DMA2_IT_GL1: DMA2 Channel1 global interrupt.
  *            @arg DMA2_IT_TC1: DMA2 Channel1 transfer complete interrupt.
  *            @arg DMA2_IT_HT1: DMA2 Channel1 half transfer interrupt.
  *            @arg DMA2_IT_TE1: DMA2 Channel1 transfer error interrupt.
  *            @arg DMA2_IT_GL2: DMA2 Channel2 global interrupt.
  *            @arg DMA2_IT_TC2: DMA2 Channel2 transfer complete interrupt.
  *            @arg DMA2_IT_HT2: DMA2 Channel2 half transfer interrupt.
  *            @arg DMA2_IT_TE2: DMA2 Channel2 transfer error interrupt.
  *            @arg DMA2_IT_GL3: DMA2 Channel3 global interrupt.
  *            @arg DMA2_IT_TC3: DMA2 Channel3 transfer complete interrupt.
  *            @arg DMA2_IT_HT3: DMA2 Channel3 half transfer interrupt.
  *            @arg DMA2_IT_TE3: DMA2 Channel3 transfer error interrupt.
  *            @arg DMA2_IT_GL4: DMA2 Channel4 global interrupt.
  *            @arg DMA2_IT_TC4: DMA2 Channel4 transfer complete interrupt.
  *            @arg DMA2_IT_HT4: DMA2 Channel4 half transfer interrupt.
  *            @arg DMA2_IT_TE4: DMA2 Channel4 transfer error interrupt.
  *            @arg DMA2_IT_GL5: DMA2 Channel5 global interrupt.
  *            @arg DMA2_IT_TC5: DMA2 Channel5 transfer complete interrupt.
  *            @arg DMA2_IT_HT5: DMA2 Channel5 half transfer interrupt.
  *            @arg DMA2_IT_TE5: DMA2 Channel5 transfer error interrupt.
  *     
  * @note   Clearing the Global interrupt (DMAy_IT_GLx) results in clearing all other 
  *         interrupts relative to the same channel (Transfer Complete, Half-transfer 
  *         Complete and Transfer Error interrupts: DMAy_IT_TCx, DMAy_IT_HTx and 
  *         DMAy_IT_TEx).  
  *        
  * @retval None
  */
void DMA_ClearITPendingBit(uint32_t DMAy_IT)
{
  /* Check the parameters */
  assert_param(IS_DMA_CLEAR_IT(DMAy_IT));

  /* Calculate the used DMAy */
  if ((DMAy_IT & FLAG_Mask) != (uint32_t)RESET)
  {
    /* Clear the selected DMAy interrupt pending bits */
    DMA2->IFCR = DMAy_IT;
  }
  else
  {
    /* Clear the selected DMAy interrupt pending bits */
    DMA1->IFCR = DMAy_IT;
  }
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
